{
  "what is your name": "My name is Jarvis.",
  "who are you": "I am Jarvis, your AI-powered desktop assistant.",
  "who is your creator": "I was created by Arnab Dey.",
  "introduce yourself": "I am Jarvis, an AI assistant designed to help with software development, system control, and information retrieval. How may I assist you today?",
  "what is your purpose": "My purpose is to enhance your productivity by assisting with coding, system management, and providing accurate information.",
  "how are you": "I am functioning optimally, ready to assist you.",
  "what can you do for me": "I can control your system, answer technical questions, help with coding, manage your schedule, and retrieve information.",
  "open terminal": "Opening the terminal.",
  "open command prompt": "Opening Command Prompt.",
  "open powershell": "Opening PowerShell.",
  "launch visual studio code": "Launching Visual Studio Code.",
  "open intellij idea": "Opening IntelliJ IDEA.",
  "open pycharm": "Opening PyCharm.",
  "open webstorm": "Opening WebStorm.",
  "open eclipse": "Opening Eclipse.",
  "open sublime text": "Opening Sublime Text.",
  "open postman": "Opening Postman.",
  "open docker": "Opening Docker Desktop.",
  "open slack": "Opening Slack.",
  "open discord": "Opening Discord.",
  "open microsoft teams": "Opening Microsoft Teams.",
  "open zoom": "Opening Zoom.",
  "open spotify": "Opening Spotify.",
  "open browser": "Opening your default web browser.",
  "open chrome": "Opening Google Chrome.",
  "open firefox": "Opening Mozilla Firefox.",
  "open edge": "Opening Microsoft Edge.",
  "open file explorer": "Opening File Explorer.",
  "open finder": "Opening Finder.",
  "show desktop": "Minimizing all windows.",
  "close this window": "Closing the current window.",
  "minimize window": "Minimizing the current window.",
  "maximize window": "Maximizing the current window.",
  "switch window": "Switching to the next open window.",
  "next desktop": "Switching to the next virtual desktop.",
  "previous desktop": "Switching to the previous virtual desktop.",
  "take a screenshot": "Capturing a screenshot.",
  "record screen": "Starting screen recording.",
  "stop recording": "Stopping the screen recording.",
  "shutdown computer": "Initiating system shutdown.",
  "restart computer": "Initiating system restart.",
  "sleep mode": "Putting the system to sleep.",
  "lock screen": "Locking your workstation.",
  "log out": "Logging out of your user session.",
  "mute volume": "Muting audio.",
  "unmute volume": "Unmuting audio.",
  "volume up": "Increasing volume.",
  "volume down": "Decreasing volume.",
  "volume 50": "Setting volume to 50 percent.",
  "brightness up": "Increasing display brightness.",
  "brightness down": "Decreasing display brightness.",
  "disable wifi": "Disabling Wi-Fi.",
  "enable wifi": "Enabling Wi-Fi.",
  "disable bluetooth": "Disabling Bluetooth.",
  "enable bluetooth": "Enabling Bluetooth.",
  "what is my ip address": "Your local IP address is {local_ip}. Your public IP address is {public_ip}.",
  "check battery status": "Battery is at {percentage} percent. {status}.",
  "is my camera on": "Your camera is currently inactive.",
  "is my microphone on": "Your microphone is currently inactive.",
  "create a new file": "Creating a new file. What would you like to name it?",
  "create a new directory": "Creating a new directory. What would you like to name it?",
  "list files in this directory": "Listing files and subdirectories.",
  "go to parent directory": "Navigating to the parent directory.",
  "go to home directory": "Navigating to the home directory.",
  "open downloads folder": "Opening the Downloads directory.",
  "open documents folder": "Opening the Documents directory.",
  "find file [filename]": "Searching for files named [filename].",
  "search for text [text] in files": "Searching for text \"[text]\" within files in the current directory.",
  "delete this file": "Moving the specified file to the recycle bin.",
  "empty recycle bin": "Emptying the recycle bin.",
  "what is python": "Python is a high-level, interpreted programming language known for its clear syntax and readability.",
  "what is java": "Java is a class-based, object-oriented programming language designed to have minimal implementation dependencies.",
  "what is javascript": "JavaScript is a scripting language primarily used for client-side web development.",
  "what is typescript": "TypeScript is a superset of JavaScript that adds static typing and other features.",
  "what is c sharp": "C# is a modern, object-oriented programming language developed by Microsoft.",
  "what is c plus plus": "C++ is a general-purpose programming language with object-oriented features.",
  "what is go": "Go (or Golang) is a statically typed, compiled language designed at Google.",
  "what is rust": "Rust is a systems programming language focused on safety, speed, and concurrency.",
  "what is kotlin": "Kotlin is a cross-platform, statically typed language that interoperates with Java.",
  "what is swift": "Swift is a powerful programming language developed by Apple for iOS and macOS development.",
  "what is html": "HTML (HyperText Markup Language) is the standard language for creating web pages.",
  "what is css": "CSS (Cascading Style Sheets) is used to style and layout web pages.",
  "what is sql": "SQL (Structured Query Language) is used to communicate with and manipulate databases.",
  "what is an api": "An API (Application Programming Interface) is a set of rules for building software applications.",
  "what is rest api": "A REST API is an architectural style for designing networked applications using HTTP requests.",
  "what is graphql": "GraphQL is a query language for your API that allows clients to request only the data they need.",
  "what is soap": "SOAP is a messaging protocol for exchanging structured information in web services.",
  "what is json": "JSON (JavaScript Object Notation) is a lightweight data-interchange format.",
  "what is xml": "XML (eXtensible Markup Language) is a markup language that defines a set of rules for encoding documents.",
  "what is yaml": "YAML is a human-readable data serialization standard.",
  "what is a compiler": "A compiler transforms source code written in a programming language into machine code.",
  "what is an interpreter": "An interpreter directly executes instructions written in a programming language without compiling them.",
  "what is object oriented programming": "Object-oriented programming (OOP) is a paradigm based on the concept of \"objects\".",
  "what is functional programming": "Functional programming is a paradigm that treats computation as the evaluation of mathematical functions.",
  "what is procedural programming": "Procedural programming is a paradigm based on procedure calls.",
  "what is declarative programming": "Declarative programming expresses the logic of a computation without describing its control flow.",
  "what is a class": "A class is a blueprint for creating objects in object-oriented programming.",
  "what is an object": "An object is an instance of a class.",
  "what is inheritance": "Inheritance allows a class to derive properties from another class.",
  "what is polymorphism": "Polymorphism allows objects of different types to be treated as objects of a common type.",
  "what is encapsulation": "Encapsulation is the bundling of data with the methods that operate on that data.",
  "what is abstraction": "Abstraction is the concept of hiding complex implementation details.",
  "what is a framework": "A framework is a platform for developing software applications.",
  "what is a library": "A library is a collection of pre-written code that can be used to develop software.",
  "what is an algorithm": "An algorithm is a step-by-step procedure to solve a problem or perform a computation.",
  "what is a data structure": "A data structure is a way of organizing and storing data for efficient access.",
  "what is big o notation": "Big O notation describes the performance or complexity of an algorithm.",
  "what is time complexity": "Time complexity defines the amount of time an algorithm takes to run as a function of input size.",
  "what is space complexity": "Space complexity defines the amount of memory an algorithm uses as a function of input size.",
  "what is recursion": "Recursion is a method where a function calls itself to solve a problem.",
  "what is version control": "Version control is a system that records changes to files over time.",
  "what is git": "Git is a distributed version control system.",
  "what is github": "GitHub is a web-based hosting service for Git repositories.",
  "what is gitlab": "GitLab is a web-based DevOps lifecycle tool that provides a Git repository manager.",
  "what is bitbucket": "Bitbucket is a web-based version control repository hosting service owned by Atlassian.",
  "what is a pull request": "A pull request is a method of submitting contributions to a development project.",
  "what is a merge conflict": "A merge conflict occurs when Git cannot automatically resolve differences in code between two commits.",
  "what is ci cd": "CI/CD stands for Continuous Integration and Continuous Deployment, a method to frequently deliver apps.",
  "what is jenkins": "Jenkins is an open-source automation server for CI/CD.",
  "what is travis ci": "Travis CI is a hosted continuous integration service used to build and test software projects.",
  "what is circleci": "CircleCI is a continuous integration and delivery platform.",
  "what is github actions": "GitHub Actions is a CI/CD tool that allows you to automate workflows within GitHub.",
  "what is docker": "Docker is a platform for developing, shipping, and running applications in containers.",
  "what is a container": "A container is a standard unit of software that packages up code and all its dependencies.",
  "what is kubernetes": "Kubernetes is an open-source system for automating deployment, scaling, and management of containerized applications.",
  "what is a pod": "A Pod is the smallest deployable unit in Kubernetes, which can contain one or more containers.",
  "aws": "AWS (Amazon Web Services) is a comprehensive cloud computing platform.",
  "what is azure": "Microsoft Azure is a cloud computing service for building, testing, deploying, and managing applications.",
  "what is google cloud": "Google Cloud Platform is a suite of cloud computing services.",
  "what is lambda": "AWS Lambda is a serverless computing service that runs code in response to events.",
  "what is ec2": "Amazon EC2 provides scalable computing capacity in the AWS cloud.",
  "what is s3": "Amazon S3 is object storage built to store and retrieve any amount of data.",
  "what is virtual machine": "A virtual machine is an emulation of a computer system.",
  "what is serverless": "Serverless is a cloud computing execution model where the cloud provider dynamically manages server allocation.",
  "what is microservices": "Microservices are an architectural style that structures an application as a collection of loosely coupled services.",
  "what is monolithic architecture": "A monolithic architecture is a unified model for the design of a software program.",
  "what is agile methodology": "Agile is an iterative approach to project management and software development.",
  "what is scrum": "Scrum is an Agile framework for managing complex knowledge work.",
  "what is kanban": "Kanban is a visual system for managing work as it moves through a process.",
  "what is devops": "DevOps is a set of practices that combines software development and IT operations.",
  "what is site reliability engineering": "SRE is a discipline that incorporates aspects of software engineering into IT operations.",
  "what is a bug": "A bug is an error, flaw, or fault in a computer program that causes it to produce an incorrect result.",
  "what is debugging": "Debugging is the process of finding and resolving bugs within a program.",
  "what is testing": "Software testing is an investigation to provide information about the quality of the software.",
  "what is unit testing": "Unit testing is a level of testing where individual units/components of a software are tested.",
  "what is integration testing": "Integration testing is a level of testing where individual units are combined and tested as a group.",
  "what is end to end testing": "End-to-end testing is a methodology used to test whether the flow of an application is performing as designed.",
  "what is regression testing": "Regression testing ensures that recently added code does not adversely affect existing features.",
  "what is tdd": "TDD (Test-Driven Development) is a software development process where tests are written before the code.",
  "what is bdd": "BDD (Behavior-Driven Development) is an Agile software development process encouraging collaboration.",
  "what is code review": "Code review is a systematic examination of computer source code.",
  "what is refactoring": "Refactoring is restructuring existing code without changing its external behavior.",
  "what is technical debt": "Technical debt is the implied cost of additional rework caused by choosing an easy solution now instead of a better approach.",
  "what is a design pattern": "A design pattern is a general reusable solution to a commonly occurring problem within a given context.",
  "what is singleton pattern": "The Singleton pattern ensures a class has only one instance and provides a global point of access to it.",
  "what is factory pattern": "The Factory pattern provides an interface for creating objects in a superclass.",
  "what is observer pattern": "The Observer pattern defines a one-to-many dependency between objects.",
  "what is mvc pattern": "MVC (Model-View-Controller) is a pattern for implementing user interfaces.",
  "what is mvvm pattern": "MVVM (Model-View-ViewModel) is a pattern that facilitates a separation of development of the GUI and business logic.",
  "what is middleware": "Middleware is software that provides common services and capabilities to applications outside of what's offered by the OS.",
  "what is authentication": "Authentication is the process of verifying the identity of a user or process.",
  "what is authorization": "Authorization is the function of specifying access rights/privileges to resources.",
  "what is oauth": "OAuth is an open standard for access delegation, commonly used for token-based authentication.",
  "what is jwt": "JWT (JSON Web Token) is an open standard for securely transmitting information between parties.",
  "what is ssl": "SSL (Secure Sockets Layer) is a protocol for establishing authenticated and encrypted links between networked computers.",
  "what is tls": "TLS (Transport Layer Security) is the successor to SSL, a cryptographic protocol for secure communication.",
  "what is https": "HTTPS is the secure version of HTTP, using SSL/TLS to encrypt communication.",
  "what is cors": "CORS (Cross-Origin Resource Sharing) is a mechanism that allows restricted resources on a web page to be requested from another domain.",
  "what is a reverse proxy": "A reverse proxy is a server that sits in front of web servers and forwards client requests.",
  "what is nginx": "Nginx is a web server that can also be used as a reverse proxy, load balancer, and HTTP cache.",
  "what is apache": "Apache HTTP Server is a free and open-source web server.",
  "what is graph database": "A graph database uses graph structures for semantic queries with nodes, edges, and properties.",
  "what is relational database": "A relational database is a digital database based on the relational model of data.",
  "what is nosql database": "A NoSQL database provides a mechanism for storage and retrieval of data that is modeled differently from relational databases.",
  "what is mysql": "MySQL is an open-source relational database management system.",
  "what is postgresql": "PostgreSQL is a powerful, open-source object-relational database system.",
  "what is mongodb": "MongoDB is a source-available cross-platform document-oriented database program.",
  "what is redis": "Redis is an in-memory data structure store, used as a database, cache, and message broker.",
  "what is elasticsearch": "Elasticsearch is a search engine based on the Lucene library.",
  "what is kibana": "Kibana is an open-source data visualization dashboard for Elasticsearch.",
  "what is logstash": "Logstash is a server-side data processing pipeline that ingests data from multiple sources.",
  "what is prometheus": "Prometheus is an open-source systems monitoring and alerting toolkit.",
  "what is grafana": "Grafana is an open-source platform for monitoring and observability.",
  "what is terraform": "Terraform is an infrastructure as code tool for building, changing, and versioning infrastructure.",
  "what is ansible": "Ansible is an open-source software provisioning, configuration management, and application-deployment tool.",
  "what is puppet": "Puppet is a software configuration management tool.",
  "what is chef": "Chef is a powerful automation platform that transforms infrastructure into code.",
  "what is vagrant": "Vagrant is a tool for building and managing virtual machine environments.",
  "what is virtualbox": "VirtualBox is a free and open-source hosted hypervisor for virtualisation.",
  "what is vmware": "VMware is a company that provides cloud computing and virtualization software and services.",
  "what is cybersecurity": "Cybersecurity is the practice of protecting systems, networks, and programs from digital attacks.",
  "what is encryption": "Encryption is the process of converting information or data into a code to prevent unauthorized access.",
  "what is hashing": "Hashing is the process of converting an input of any length into a fixed-size string of text.",
  "what is a firewall": "A firewall is a network security system that monitors and controls incoming and outgoing network traffic.",
  "what is a vpn": "A VPN (Virtual Private Network) extends a private network across a public network.",
  "what is phishing": "Phishing is a cyberattack that uses disguised email as a weapon.",
  "what is malware": "Malware is any software intentionally designed to cause damage to a computer, server, or network.",
  "what is ransomware": "Ransomware is a type of malware that threatens to publish or block access to data unless a ransom is paid.",
  "what is a ddos attack": "A DDoS attack is a malicious attempt to disrupt normal traffic of a targeted server by overwhelming it with a flood of Internet traffic.",
  "what is social engineering": "Social engineering is the psychological manipulation of people into performing actions or divulging confidential information.",
  "what is zero trust": "Zero Trust is a security concept centered on the belief that organizations should not automatically trust anything inside or outside its perimeters.",
  "what is machine learning": "Machine learning is a method of data analysis that automates analytical model building.",
  "what is deep learning": "Deep learning is part of a broader family of machine learning methods based on artificial neural networks.",
  "what is neural network": "A neural network is a series of algorithms that endeavors to recognize underlying relationships in a set of data.",
  "what is supervised learning": "Supervised learning is the machine learning task of learning a function that maps an input to an output based on example input-output pairs.",
  "what is unsupervised learning": "Unsupervised learning is a type of machine learning that looks for previously undetected patterns in a data set.",
  "what is reinforcement learning": "Reinforcement learning is an area of machine learning concerned with how software agents ought to take actions in an environment.",
  "what is nlp": "NLP (Natural Language Processing) is a subfield of AI focused on enabling computers to understand and process human language.",
  "what is computer vision": "Computer vision is a field of AI that enables computers to derive meaningful information from visual inputs.",
  "what is tensorflow": "TensorFlow is a free and open-source software library for machine learning and artificial intelligence.",
  "what is pytorch": "PyTorch is an open-source machine learning library based on the Torch library.",
  "what is scikit learn": "Scikit-learn is a free software machine learning library for the Python programming language.",
  "what is opencv": "OpenCV is a library of programming functions mainly aimed at real-time computer vision.",
  "what is data mining": "Data mining is the process of discovering patterns in large data sets.",
  "what is data visualization": "Data visualization is the graphic representation of data.",
  "what is matplotlib": "Matplotlib is a plotting library for the Python programming language.",
  "what is seaborn": "Seaborn is a Python data visualization library based on matplotlib.",
  "what is pandas": "Pandas is a software library written for data manipulation and analysis in Python.",
  "what is numpy": "NumPy is a library for the Python programming language, adding support for large, multi-dimensional arrays and matrices.",
  "what is jupyter notebook": "Jupyter Notebook is an open-source web application that allows you to create and share documents containing live code.",
  "what is blockchain": "Blockchain is a system of recording information in a way that makes it difficult or impossible to change or hack.",
  "what is cryptocurrency": "A cryptocurrency is a digital or virtual currency that is secured by cryptography.",
  "what is bitcoin": "Bitcoin is a decentralized digital currency, without a central bank or single administrator.",
  "what is ethereum": "Ethereum is a decentralized, open-source blockchain with smart contract functionality.",
  "what is smart contract": "A smart contract is a self-executing contract with the terms of the agreement directly written into code.",
  "what is nft": "An NFT is a non-fungible token, a unique digital asset stored on a blockchain.",
  "what is web3": "Web3 is an idea for a new iteration of the World Wide Web based on blockchain technology.",
  "what is metaverse": "The metaverse is a collective virtual shared space, created by the convergence of virtually enhanced physical reality.",
  "what is ar": "AR (Augmented Reality) is an interactive experience where digital objects are overlaid onto the real world.",
  "what is vr": "VR (Virtual Reality) is a simulated experience that can be similar to or completely different from the real world.",
  "what is iot": "IoT (Internet of Things) describes the network of physical objects embedded with sensors and software.",
  "what is 5g": "5G is the fifth generation technology standard for broadband cellular networks.",
  "what is quantum computing": "Quantum computing is the use of quantum phenomena like superposition and entanglement to perform computation.",
  "what is an api key": "An API key is a code used to identify and authenticate a user or application calling an API.",
  "what is an sdk": "An SDK (Software Development Kit) is a collection of software development tools in one installable package.",
  "what is an ide": "An IDE (Integrated Development Environment) is a software application that provides comprehensive facilities for software development.",
  "what is a cli": "A CLI (Command-Line Interface) is a text-based interface used to interact with software and operating systems.",
  "what is gui": "A GUI (Graphical User Interface) is a system of interactive visual components for computer software.",
  "what is ux": "UX (User Experience) design is the process design teams use to create products that provide meaningful experiences to users.",
  "what is ui": "UI (User Interface) design is the process designers use to build interfaces in software, with a focus on looks and style.",
  "what is responsive design": "Responsive design is an approach to web design that makes web pages render well on a variety of devices.",
  "what is seo": "SEO (Search Engine Optimization) is the process of improving the quality and quantity of website traffic.",
  "what is agile sprint": "An Agile sprint is a fixed time period (usually 2-4 weeks) during which a team works to complete a set amount of work.",
  "what is a user story": "A user story is an informal, natural language description of a software feature from an end-user perspective.",
  "what is a product backlog": "A product backlog is a prioritized list of work for the development team derived from the roadmap.",
  "what is a sprint backlog": "A sprint backlog is the set of product backlog items selected for the sprint, plus a plan for delivering them.",
  "what is a standup meeting": "A standup meeting is a short daily meeting where the team discusses progress and obstacles.",
  "what is velocity": "Velocity is a metric that predicts how much work an Agile team can complete in a sprint.",
  "what is burn down chart": "A burn down chart is a graphical representation of work left to do versus time.",
  "what is version number": "Version numbers are used to identify unique states of computer software.",
  "what is semantic versioning": "Semantic Versioning is a versioning scheme for software using a three-part number: Major.Minor.Patch.",
  "what is a changelog": "A changelog is a log or record of all notable changes made to a project.",
  "what is a license": "A software license is a legal instrument governing the use or redistribution of software.",
  "what is mit license": "The MIT License is a permissive free software license.",
  "what is gpl": "GPL (GNU General Public License) is a series of widely used free software licenses.",
  "what is open source": "Open source denotes software for which the original source code is made freely available.",
  "what is proprietary software": "Proprietary software is software that is owned by an individual or a company.",
  "what is saas": "SaaS (Software as a Service) is a software licensing and delivery model in which software is licensed on a subscription basis.",
  "what is paas": "PaaS (Platform as a Service) provides a platform allowing customers to develop, run, and manage applications.",
  "what is iaas": "IaaS (Infrastructure as a Service) provides virtualized computing resources over the internet.",
  "what is a bug report": "A bug report is a detailed description of a problem experienced with software.",
  "what is a feature request": "A feature request is a suggestion for a new feature or an enhancement to an existing feature.",
  "what is a use case": "A use case is a description of how a user interacts with a system to achieve a goal.",
  "what is a uml diagram": "UML (Unified Modeling Language) is a general-purpose modeling language used to visualize the design of a system.",
  "what is an er diagram": "An ER (Entity Relationship) diagram is a visual representation of entities and their relationships.",
  "what is a flowchart": "A flowchart is a diagram that depicts a process, system, or computer algorithm.",
  "what is pseudocode": "Pseudocode is an informal high-level description of the operating principle of a computer program.",
  "what is a stack overflow": "A stack overflow is an error that occurs when a program's call stack exceeds its memory limit.",
  "what is a null pointer exception": "A NullPointerException is an error thrown when an application attempts to use an object reference that has the null value.",
  "what is a memory leak": "A memory leak is a type of resource leak that occurs when a computer program incorrectly manages memory allocations.",
  "what is garbage collection": "Garbage collection is the process of automatically freeing memory that is no longer in use by the program.",
  "what is a callback function": "A callback function is a function passed into another function as an argument to be executed later.",
  "what is a promise": "A Promise is an object representing the eventual completion or failure of an asynchronous operation.",
  "what is async await": "Async/await is syntactic sugar built on promises for writing asynchronous code in a more synchronous manner.",
  "what is multithreading": "Multithreading is the ability of a CPU to provide multiple threads of execution concurrently.",
  "what is concurrency": "Concurrency is the ability of different parts of a program to be executed out-of-order without affecting the outcome.",
  "what is parallelism": "Parallelism is the technique of performing multiple computations simultaneously.",
  "what is a race condition": "A race condition is an undesirable situation that occurs when a system's behavior depends on the sequence of events.",
  "what is a deadlock": "A deadlock is a state in which each member of a group is waiting for another member to take action.",
  "what is a mutex": "A mutex is a program object that prevents multiple threads from accessing a shared resource simultaneously.",
  "what is a semaphore": "A semaphore is a variable or abstract data type used to control access to a common resource.",
  "what is a critical section": "A critical section is a part of a program that accesses a shared resource.",
  "what is an interrupt": "An interrupt is a signal to the processor emitted by hardware or software indicating an event needs immediate attention.",
  "what is a kernel": "The kernel is a computer program at the core of a computer's operating system with complete control over everything.",
  "what is a shell": "A shell is a user interface for access to an operating system's services.",
  "what is bash": "Bash is a Unix shell and command language.",
  "what is zsh": "Zsh is an extended Bourne shell with many improvements.",
  "what is ssh": "SSH (Secure Shell) is a protocol for secure network services over an unsecured network.",
  "what is ftp": "FTP (File Transfer Protocol) is a standard network protocol for transferring computer files.",
  "what is sftp": "SFTP (SSH File Transfer Protocol) is a secure file transfer protocol.",
  "what is http": "HTTP (Hypertext Transfer Protocol) is the foundation of data communication for the World Wide Web.",
  "what is a cookie": "An HTTP cookie is a small piece of data sent from a website and stored on the user's computer.",
  "what is a session": "A session is a temporary and interactive information interchange between two or more communicating devices.",
  "what is cache": "A cache is a hardware or software component that stores data for future requests.",
  "what is cdn": "A CDN (Content Delivery Network) is a geographically distributed network of proxy servers.",
  "what is load balancing": "Load balancing distributes network or application traffic across multiple servers.",
  "what is horizontal scaling": "Horizontal scaling means adding more machines to your pool of resources.",
  "what is vertical scaling": "Vertical scaling means adding more power (CPU, RAM) to an existing machine.",
  "what is a proxy server": "A proxy server acts as an intermediary between a client and a server.",
  "what is dns": "DNS (Domain Name System) is the phonebook of the Internet, translating domain names to IP addresses.",
  "what is dhcp": "DHCP (Dynamic Host Configuration Protocol) is a network management protocol used to assign IP addresses.",
  "what is tcp": "TCP (Transmission Control Protocol) is a standard that defines how to establish and maintain a network conversation.",
  "what is udp": "UDP (User Datagram Protocol) is a communication protocol used for time-sensitive transmissions.",
  "what is ip address": "An IP address is a unique address that identifies a device on the internet or a local network.",
  "what is ipv4": "IPv4 is the fourth version of the Internet Protocol, using a 32-bit address space.",
  "what is ipv6": "IPv6 is the most recent version of the Internet Protocol, using a 128-bit address space.",
  "what is a subnet": "A subnet is a logical subdivision of an IP network.",
  "what is a router": "A router is a networking device that forwards data packets between computer networks.",
  "what is a switch": "A network switch is a networking device that connects devices on a computer network.",
  "what is a hub": "A hub is a basic networking device that connects multiple Ethernet devices together.",
  "what is lan": "LAN (Local Area Network) is a computer network that interconnects computers within a limited area.",
  "what is wan": "WAN (Wide Area Network) is a telecommunications network that extends over a large geographic area.",
  "what is vlan": "VLAN (Virtual Local Area Network) is any broadcast domain that is partitioned and isolated in a computer network.",
  "what is nat": "NAT (Network Address Translation) is a method of mapping an IP address space into another.",
  "what is port forwarding": "Port forwarding is an application of network address translation that redirects a communication request.",
  "what is a socket": "A network socket is an endpoint for sending and receiving data across a computer network.",
  "what is rpc": "RPC (Remote Procedure Call) is when a computer program causes a procedure to execute in a different address space.",
  "what is grpc": "gRPC is a modern open source high performance RPC framework that can run in any environment.",
  "what is xmlrpc": "XML-RPC is a remote procedure call protocol which uses XML to encode its calls and HTTP as a transport mechanism.",
  "what is message queue": "A message queue is a form of asynchronous service-to-service communication used in serverless and microservices architectures.",
  "what is rabbitmq": "RabbitMQ is an open-source message-broker software that originally implemented the Advanced Message Queuing Protocol.",
  "what is kafka": "Apache Kafka is a distributed event streaming platform capable of handling trillions of events a day.",
  "what is redis pub sub": "Redis Pub/Sub implements the Publish/Subscribe messaging paradigm where senders are not programmed to send messages to specific receivers.",
  "what is cron job": "A cron job is a time-based job scheduler in Unix-like computer operating systems.",
  "what is a daemon": "A daemon is a computer program that runs as a background process.",
  "what is a service": "A service is a program that runs in the background independent of user interaction.",
  "what is a thread": "A thread is the smallest sequence of programmed instructions that can be managed independently by a scheduler.",
  "what is a process": "A process is an instance of a computer program that is being executed.",
  "what is an environment variable": "An environment variable is a dynamic-named value that can affect the way running processes behave.",
  "what is a path variable": "The PATH environment variable specifies a set of directories where executable programs are located.",
  "what is a shebang": "A shebang is the character sequence consisting of the characters number sign and exclamation mark at the beginning of a script.",
  "what is a makefile": "A Makefile is a file containing a set of directives used by a make build automation tool.",
  "what is cmake": "CMake is a cross-platform free and open-source software tool for managing the build process of software.",
  "what is gradle": "Gradle is an open-source build automation tool focused on flexibility and performance.",
  "what is maven": "Apache Maven is a software project management and comprehension tool.",
  "what is ant": "Apache Ant is a software tool for automating software build processes.",
  "what is npm": "npm is a package manager for the JavaScript programming language.",
  "what is yarn": "YARN is a resource-management platform responsible for managing compute resources in clusters.",
  "what is pip": "pip is a package-management system used to install and manage software packages written in Python.",
  "what is composer": "Composer is an application-level package manager for the PHP programming language.",
  "what is rubygems": "RubyGems is a package manager for the Ruby programming language.",
  "what is cargo": "Cargo is the Rust package manager.",
  "what is nuget": "NuGet is the package manager for .NET.",
  "what is homebrew": "Homebrew is a free and open-source software package management system for macOS.",
  "what is apt": "APT (Advanced Package Tool) is a package management system for Debian-based Linux distributions.",
  "what is yum": "YUM (Yellowdog Updater, Modified) is a package manager for RPM-based Linux distributions.",
  "what is dnf": "DNF is the next-generation version of YUM, a package manager for RPM-based Linux distributions.",
  "what is pacman": "Pacman is a package manager for the Arch Linux distribution.",
  "what is a container registry": "A container registry is a repository for storing and distributing container images.",
  "what is docker hub": "Docker Hub is a service provided by Docker for finding and sharing container images.",
  "what is dockerfile": "A Dockerfile is a text document that contains all the commands to assemble a Docker image.",
  "what is docker compose": "Docker Compose is a tool for defining and running multi-container Docker applications.",
  "what is docker swarm": "Docker Swarm is a container orchestration tool native to Docker.",
  "what is helm": "Helm is a package manager for Kubernetes.",
  "what is a kubernetes manifest": "A Kubernetes manifest is a specification of a Kubernetes object in YAML or JSON format.",
  "what is a kubernetes service": "A Kubernetes Service is an abstraction which defines a logical set of Pods and a policy to access them.",
  "what is a kubernetes ingress": "An Ingress is an API object that manages external access to services in a cluster.",
  "what is a kubernetes configmap": "A ConfigMap is an API object used to store non-confidential data in key-value pairs.",
  "what is a kubernetes secret": "A Secret is an object that contains a small amount of sensitive data.",
  "what is a kubernetes namespace": "A Kubernetes namespace is a virtual cluster within a physical cluster.",
  "what is a kubernetes node": "A Node is a worker machine in Kubernetes, previously known as a minion.",
  "what is a kubernetes cluster": "A cluster is a set of nodes that run containerized applications.",
  "what is istio": "Istio is an open source service mesh that layers transparently onto existing distributed applications.",
  "what is linkerd": "Linkerd is an ultralight, security-first service mesh for Kubernetes.",
  "what is envoy": "Envoy is an open source edge and service proxy designed for cloud-native applications.",
  "what is a service mesh": "A service mesh is a dedicated infrastructure layer for making service-to-service communication safe, fast, and reliable.",
  "what is serverless framework": "The Serverless Framework is a free and open-source web framework for building serverless applications.",
  "what is aws sam": "AWS SAM (Serverless Application Model) is an open-source framework for building serverless applications.",
  "what is aws cdk": "The AWS CDK (Cloud Development Kit) is an open-source software development framework to define cloud infrastructure in code.",
  "what is pulumi": "Pulumi is an open source infrastructure as code tool for creating, deploying, and managing cloud infrastructure.",
  "what is saltstack": "SaltStack is a Python-based open-source configuration management software and remote execution engine.",
  "what is packer": "Packer is an open source tool for creating identical machine images for multiple platforms from a single source configuration.",
  "what is consul": "Consul is a service networking solution to connect and secure services across any runtime platform.",
  "what is vault": "HashiCorp Vault is a tool for securely accessing secrets.",
  "what is nomad": "HashiCorp Nomad is a flexible workload orchestrator that can deploy any application.",
  "what is elk stack": "The ELK Stack is a collection of three open-source products: Elasticsearch, Logstash, and Kibana.",
  "what is splunk": "Splunk is a software platform to search, analyze, and visualize machine-generated data.",
  "what is datadog": "Datadog is a monitoring service for cloud-scale applications.",
  "what is new relic": "New Relic is a software analytics company that provides performance monitoring solutions.",
  "what is sentry": "Sentry is an open-source error tracking tool that helps developers monitor and fix crashes in real time.",
  "what is raygun": "Raygun is an error and performance monitoring platform for software teams.",
  "what is loggly": "Loggly is a cloud-based log management and analytics service.",
  "what is papertrail": "Papertrail is a cloud-based log management service.",
  "what is a log": "A log is a record of events that happen in software or a system.",
  "what is a metric": "A metric is a measurement of a particular property of a system over time.",
  "what is a trace": "A trace is a record of the execution path of a request as it moves through a system.",
  "what is observability": "Observability is a measure of how well internal states of a system can be inferred from knowledge of its external outputs.",
  "what is apm": "APM (Application Performance Management) is the monitoring and management of performance and availability of software applications.",
  "what is rum": "RUM (Real User Monitoring) captures and analyzes every transaction of every user of your web or mobile application.",
  "what is synthetic monitoring": "Synthetic monitoring involves using automated scripts to simulate user paths to monitor application performance.",
  "what is a dashboard": "A dashboard is a visual display of the most important information needed to achieve objectives.",
  "what is an alert": "An alert is a notification triggered by a specific event or condition in a system.",
  "what is a incident": "An incident is an event that disrupts or could disrupt a service.",
  "what is a postmortem": "A postmortem is a written record of an incident, its impact, the actions taken to mitigate it, and follow-up actions.",
  "what is root cause analysis": "Root cause analysis is a method of problem solving used for identifying the root causes of faults or problems.",
  "what is the five whys": "The 5 Whys is an iterative interrogative technique used to explore the cause-and-effect relationships underlying a problem.",
  "what is a fishbone diagram": "A fishbone diagram is a cause-and-effect diagram that helps identify possible causes for a problem.",
  "what is a pareto chart": "A Pareto chart is a type of chart that contains both bars and a line graph.",
  "what is a histogram": "A histogram is an approximate representation of the distribution of numerical data.",
  "what is a scatter plot": "A scatter plot is a type of plot using Cartesian coordinates to display values for two variables.",
  "what is a box plot": "A box plot is a method for graphically depicting groups of numerical data through their quartiles.",
  "what is a pie chart": "A pie chart is a circular statistical graphic divided into slices to illustrate numerical proportion.",
  "what is a bar chart": "A bar chart presents categorical data with rectangular bars with heights proportional to the values.",
  "what is a line chart": "A line chart is a type of chart which displays information as a series of data points connected by straight line segments.",
  "what is a heatmap": "A heatmap is a graphical representation of data where values are depicted by color.",
  "what is a treemap": "A treemap is a method for displaying hierarchical data using nested figures, usually rectangles.",
  "what is a sankey diagram": "A Sankey diagram is a visualization used to depict a flow from one set of values to another.",
  "what is a gantt chart": "A Gantt chart is a type of bar chart that illustrates a project schedule.",
  "what is a kanban board": "A Kanban board is a work and workflow visualization tool that enables you to optimize the flow of your work.",
  "what is a mind map": "A mind map is a diagram used to visually organize information.",
  "what is a wireframe": "A wireframe is a visual guide that represents the skeletal framework of a website or application.",
  "what is a mockup": "A mockup is a full-size model of a design or device, used for demonstration or teaching.",
  "what is a prototype": "A prototype is an early sample, model, or release of a product built to test a concept.",
  "what is a ux persona": "A UX persona is a fictional character created to represent a user type that might use a site or product.",
  "what is a user journey map": "A user journey map is a visual representation of the user's experience with a product over time.",
  "what is a storyboard": "A storyboard is a graphic organizer that consists of illustrations or images displayed in sequence.",
  "what is a design system": "A design system is a collection of reusable components, guided by clear standards, that can be assembled to build applications.",
  "what is material design": "Material Design is a design language developed by Google.",
  "what is human interface guidelines": "The Human Interface Guidelines are a set of recommendations for designing software for Apple platforms.",
  "what is fluent design": "Fluent Design System is a design language developed by Microsoft.",
  "what is atomic design": "Atomic design is a methodology for creating design systems.",
  "what is a component library": "A component library is a collection of reusable components.",
  "what is a style guide": "A style guide is a set of standards for the writing and design of documents.",
  "what is a pattern library": "A pattern library is a collection of user interface design patterns.",
  "what is a ui kit": "A UI kit is a collection of pre-designed user interface elements.",
  "what is an icon set": "An icon set is a collection of icons designed in a consistent style.",
  "what is a font": "A font is a set of printable or displayable text characters in a specific style and size.",
  "what is typography": "Typography is the art and technique of arranging type to make written language legible and appealing.",
  "what is color theory": "Color theory is a body of practical guidance to color mixing and the visual effects of specific color combinations.",
  "what is accessibility": "Accessibility is the design of products so that they are usable by people with disabilities.",
  "what is wcag": "WCAG (Web Content Accessibility Guidelines) are part of a series of web accessibility guidelines.",
  "what is aria": "ARIA (Accessible Rich Internet Applications) is a set of attributes that define ways to make web content more accessible.",
  "what is responsive web design": "Responsive web design is an approach to web design that makes web pages render well on a variety of devices.",
  "what is mobile first design": "Mobile-first design is an approach where you start designing for the smallest screen first and then work your way up.",
  "what is progressive enhancement": "Progressive enhancement is a strategy for web design that emphasizes core webpage content first.",
  "what is graceful degradation": "Graceful degradation is a design philosophy that centers around trying to build a modern website that will work in the newest browsers.",
  "what is a single page application": "A single-page application is a web application that interacts with the user by dynamically rewriting the current page.",
  "what is a multi page application": "A multi-page application is a web application that consists of multiple pages.",
  "what is a static site": "A static site is a website that is delivered to the user exactly as stored.",
  "what is a dynamic site": "A dynamic site is a website that generates pages in real-time.",
  "what is a cms": "A CMS (Content Management System) is a software application used to manage the creation and modification of digital content.",
  "what is wordpress": "WordPress is a free and open-source content management system written in PHP.",
  "what is drupal": "Drupal is a free and open-source web content management framework written in PHP.",
  "what is joomla": "Joomla is a free and open-source content management system for publishing web content.",
  "what is headless cms": "A headless CMS is a back-end only content management system that makes content accessible via an API.",
  "what is graphcms": "GraphCMS is a headless content management system based on GraphQL.",
  "what is contentful": "Contentful is a headless content management platform.",
  "what is strapi": "Strapi is an open-source headless CMS.",
  "what is ghost": "Ghost is a free and open-source blogging platform.",
  "what is jekyll": "Jekyll is a simple, blog-aware, static site generator.",
  "what is hugo": "Hugo is a static site generator written in Go.",
  "what is gatsby": "Gatsby is a free and open-source framework based on React that helps developers build websites and apps.",
  "what is next js": "Next.js is a React framework that enables server-side rendering and static site generation.",
  "what is nuxt js": "Nuxt.js is a Vue.js framework for creating modern web applications.",
  "what is sveltekit": "SvelteKit is a framework for building web applications of all sizes with Svelte.",
  "what is angular": "Angular is a TypeScript-based open-source web application framework.",
  "what is react": "React is a JavaScript library for building user interfaces.",
  "what is vue": "Vue.js is an open-source model–view–viewmodel frontend JavaScript framework.",
  "what is svelte": "Svelte is a free and open-source front end compiler.",
  "what is ember js": "Ember.js is an open-source JavaScript web framework.",
  "what is backbone js": "Backbone.js is a JavaScript library with a RESTful JSON interface.",
  "what is jQuery": "jQuery is a JavaScript library designed to simplify HTML DOM tree traversal and manipulation.",
  "what is bootstrap": "Bootstrap is a free and open-source CSS framework directed at responsive, mobile-first front-end web development.",
  "what is tailwind css": "Tailwind CSS is a utility-first CSS framework.",
  "what is foundation": "Foundation is a free responsive front-end framework.",
  "what is bulma": "Bulma is a free, open-source CSS framework based on Flexbox.",
  "what is materialize": "Materialize is a modern responsive front-end framework based on Material Design.",
  "what is semantic ui": "Semantic UI is a front-end development framework.",
  "what is chakra ui": "Chakra UI is a simple, modular and accessible component library for React.",
  "what is ant design": "Ant Design is a design system for enterprise-level products.",
  "what is storybook": "Storybook is an open source tool for developing UI components in isolation.",
  "what is jest": "Jest is a JavaScript testing framework.",
  "what is mocha": "Mocha is a JavaScript test framework.",
  "what is cypress": "Cypress is a front end testing tool for web applications.",
  "what is selenium": "Selenium is a portable framework for testing web applications.",
  "what is playwright": "Playwright is a framework for Web Testing and Automation.",
  "what is puppeteer": "Puppeteer is a Node library which provides a high-level API to control Chrome or Chromium.",
  "what is phpunit": "PHPUnit is a programmer-oriented testing framework for PHP.",
  "what is rspec": "RSpec is a testing tool for Ruby.",
  "what is junit": "JUnit is a unit testing framework for the Java programming language.",
  "what is pytest": "pytest is a testing framework for Python.",
  "what is unittest": "unittest is a unit testing framework for Python.",
  "what is nose": "nose is a testing framework for Python, extends unittest.",
  "what is cargo test": "cargo test is the command to run tests for a Rust project.",
  "what is go test": "go test is the command to run tests for a Go project.",
  "what is xunit": "xUnit.net is a free, open-source unit testing tool for the .NET Framework.",
  "what is nunit": "NUnit is a unit-testing framework for all .Net languages.",
  "what is mockito": "Mockito is a mocking framework for unit tests in Java.",
  "what is sinon": "Sinon.js is a standalone test spies, stubs and mocks for JavaScript.",
  "what is enzyme": "Enzyme is a JavaScript Testing utility for React.",
  "what is testing library": "Testing Library is a family of packages helps you test UI components.",
  "what is coverage": "Coverage.py is a tool for measuring code coverage of Python programs.",
  "what is istanbul": "Istanbul is a JavaScript test coverage tool.",
  "what is sonarqube": "SonarQube is an open-source platform for continuous inspection of code quality.",
  "what is codeclimate": "Code Climate is a platform for automated code review.",
  "what is codacy": "Codacy is an automated code review tool.",
  "what is eslint": "ESLint is a static code analysis tool for identifying problematic patterns in JavaScript code.",
  "what is prettier": "Prettier is an opinionated code formatter.",
  "what is stylelint": "stylelint is a mighty CSS linter.",
  "what is rubocop": "RuboCop is a Ruby static code analyzer and formatter.",
  "what is pylint": "Pylint is a static code analyzer for Python.",
  "what is flake8": "Flake8 is a Python tool that glues together pycodestyle, pyflakes, and McCabe.",
  "what is black": "Black is the uncompromising Python code formatter.",
  "what is mypy": "mypy is a static type checker for Python.",
  "what is typescript compiler": "The TypeScript compiler compiles TypeScript code into JavaScript.",
  "what is babel": "Babel is a JavaScript compiler that converts edge JavaScript into plain old JavaScript.",
  "what is webpack": "Webpack is a static module bundler for modern JavaScript applications.",
  "what is rollup": "Rollup is a module bundler for JavaScript.",
  "what is parcel": "Parcel is a web application bundler.",
  "what is gulp": "Gulp is a toolkit for automating painful or time-consuming tasks in your development workflow.",
  "what is grunt": "Grunt is a JavaScript task runner.",
  "what is browserify": "Browserify lets you require('modules') in the browser by bundling up all of your dependencies.",
  "what is esbuild": "esbuild is an extremely fast JavaScript bundler.",
  "what is vite": "Vite is a fast frontend build tool.",
  "what is snowpack": "Snowpack is a build tool for modern web apps.",
  "what is create react app": "Create React App is a comfortable environment for learning React.",
  "what is vue cli": "Vue CLI is a full system for rapid Vue.js development.",
  "what is angular cli": "Angular CLI is a command-line interface for Angular.",
  "what is nest js": "NestJS is a framework for building efficient, scalable Node.js server-side applications.",
  "what is express js": "Express.js is a web application framework for Node.js.",
  "what is koa": "Koa is a new web framework designed by the team behind Express.",
  "what is hapi": "hapi is a rich framework for building applications and services.",
  "what is fastify": "Fastify is a web framework highly focused on providing the best developer experience.",
  "what is socket io": "Socket.IO enables real-time, bidirectional and event-based communication.",
  "what is meteor": "Meteor is an open source platform for web, mobile, and desktop.",
  "what is sails js": "Sails.js is a realtime MVC framework for Node.js.",
  "what is loopback": "LoopBack is a highly extensible Node.js framework.",
  "what is adonis js": "AdonisJS is a Node.js web framework with a focus on ergonomics and speed.",
  "what is django": "Django is a high-level Python web framework.",
  "what is flask": "Flask is a micro web framework written in Python.",
  "what is fastapi": "FastAPI is a modern, fast web framework for building APIs with Python.",
  "what is pyramid": "Pyramid is a lightweight Python web framework.",
  "what is bottle": "Bottle is a fast, simple and lightweight WSGI micro web-framework for Python.",
  "what is tornado": "Tornado is a Python web framework and asynchronous networking library.",
  "what is ruby on rails": "Ruby on Rails is a server-side web application framework written in Ruby.",
  "what is sinatra": "Sinatra is a DSL for quickly creating web applications in Ruby.",
  "what is laravel": "Laravel is a free, open-source PHP web framework.",
  "what is symfony": "Symfony is a PHP web application framework.",
  "what is codeigniter": "CodeIgniter is a powerful PHP framework with a very small footprint.",
  "what is cake php": "CakePHP is an open-source web framework.",
  "what is zend framework": "Zend Framework is a collection of professional PHP packages.",
  "what is lumen": "Lumen is a stunningly fast PHP micro-framework.",
  "what is slim": "Slim is a PHP micro framework.",
  "what is spring boot": "Spring Boot makes it easy to create stand-alone, production-grade Spring based Applications.",
  "what is quarkus": "Quarkus is a Kubernetes-native Java framework tailored for GraalVM and OpenJDK HotSpot.",
  "what is micronaut": "Micronaut is a modern, JVM-based, full-stack framework for building modular, easily testable microservice applications.",
  "what is vert x": "Vert.x is a tool-kit for building reactive applications on the JVM.",
  "what is dropwizard": "Dropwizard is a Java framework for developing ops-friendly, high-performance, RESTful web services.",
  "what is play framework": "Play Framework is a high velocity web framework for Java and Scala.",
  "what is spark java": "Spark is a micro framework for creating web applications in Java.",
  "what is javalin": "Javalin is a very lightweight web framework for Java and Kotlin.",
  "what is ktor": "Ktor is a framework for building asynchronous servers and clients in Kotlin.",
  "what is actix": "Actix is a powerful, pragmatic, and extremely fast web framework for Rust.",
  "what is rocket": "Rocket is a web framework for Rust that makes it simple to write fast, secure web applications.",
  "what is warp": "Warp is a super-easy, composable, web server framework for warp speeds.",
  "what is gin": "Gin is a HTTP web framework written in Go.",
  "what is echo": "Echo is a high performance, minimalist Go web framework.",
  "what is fiber": "Fiber is an Express inspired web framework built on top of Fasthttp.",
  "what is revel": "Revel is a high-productivity web framework for the Go language.",
  "what is beego": "Beego is an open-source, high-performance web framework for the Go programming language.",
  "what is phoenix": "Phoenix is a web development framework written in Elixir.",
  "what is asp net": "ASP.NET is an open-source web framework for building modern web apps and services with .NET.",
  "what is blazor": "Blazor is a free and open-source web framework that enables developers to create web apps using C# and HTML.",
  "what is entity framework": "Entity Framework is an open-source ORM framework for .NET applications.",
  "what is hibernate": "Hibernate is an ORM tool for the Java programming language.",
  "what is sequelize": "Sequelize is a promise-based Node.js ORM.",
  "what is typeorm": "TypeORM is an ORM that can run in Node.js and be used with TypeScript and JavaScript.",
  "what is prisma": "Prisma is an open-source ORM for Node.js and TypeScript.",
  "what is knex": "Knex.js is a SQL query builder for JavaScript.",
  "what is bookshelf": "Bookshelf.js is a JavaScript ORM for Node.js.",
  "what is objection": "Objection.js is an ORM for Node.js.",
  "what is waterline": "Waterline is the default ORM used in the Sails.js framework.",
  "what is mongoose": "Mongoose is a MongoDB object modeling tool designed to work in an asynchronous environment.",
  "what is doctrine": "Doctrine is an object-relational mapper for PHP.",
  "what is eloquent": "Eloquent is an object-relational mapper included with Laravel.",
  "what is active record": "Active Record is the M in MVC - the model - which is the layer of the system responsible for representing business data and logic.",
  "what is sqlalchemy": "SQLAlchemy is the Python SQL toolkit and Object Relational Mapper.",
  "what is peewee": "Peewee is a simple and small ORM for Python.",
  "what is pony orm": "Pony ORM is an object-relational mapper for Python.",
  "what is django orm": "The Django ORM is a powerful and elegant way to interact with databases in Django.",
  "what is sqlite": "SQLite is a C-language library that implements a small, fast, self-contained, high-reliability, full-featured, SQL database engine.",
  "what is mariadb": "MariaDB is a community-developed, commercially supported fork of the MySQL relational database management system.",
  "what is microsoft sql server": "Microsoft SQL Server is a relational database management system developed by Microsoft.",
  "what is oracle database": "Oracle Database is a multi-model database management system produced and marketed by Oracle Corporation.",
  "what is db2": "Db2 is a family of data management products from IBM.",
  "what is cassandra": "Apache Cassandra is a free and open-source, distributed, wide-column store, NoSQL database management system.",
  "what is couchdb": "Apache CouchDB is an open-source document-oriented NoSQL database.",
  "what is memcached": "Memcached is a general-purpose distributed memory caching system.",
  "what is solr": "Apache Solr is an open-source search platform.",
  "what is neo4j": "Neo4j is a graph database management system.",
  "what is arangodb": "ArangoDB is a native multi-model database system.",
  "what is orientdb": "OrientDB is an open source NoSQL database management system.",
  "what is influxdb": "InfluxDB is an open-source time series database.",
  "what is thanos": "Thanos is a set of components that can be composed into a highly available metric system.",
  "what is cortex": "Cortex is a horizontally scalable, highly available, multi-tenant, long term storage for Prometheus.",
  "what is victoriametrics": "VictoriaMetrics is a fast, cost-effective and scalable monitoring solution and time series database.",
  "what is loki": "Loki is a horizontally-scalable, highly-available, multi-tenant log aggregation system.",
  "what is tempo": "Tempo is an open source, easy-to-use and high-scale distributed tracing backend.",
  "what is jaeger": "Jaeger is open source software for tracing transactions between distributed services.",
  "what is zipkin": "Zipkin is a distributed tracing system.",
  "what is open tracing": "OpenTracing is a vendor-neutral API and instrumentation for distributed tracing.",
  "what is open census": "OpenCensus is a set of libraries for various languages that allow you to collect application metrics and distributed traces.",
  "what is open telemetry": "OpenTelemetry is a collection of APIs, SDKs, and tools to instrument, generate, collect, and export telemetry data.",
  "what is otel": "OTel is the common abbreviation for OpenTelemetry.",
  "what is a span": "A span represents a single operation within a trace.",
  "what is a event": "An event is a record of a discrete action that occurred at a particular time.",
  "what is a summary": "A summary is a metric that captures individual observations and provides a total count and sum of observations.",
  "what is a counter": "A counter is a cumulative metric that represents a single numerical value that only increases.",
  "what is a gauge": "A gauge is a metric that represents a single numerical value that can arbitrarily go up and down.",
  "what is a rate": "A rate is a metric that measures the frequency of events over time.",
  "what is a percentile": "A percentile is a measure used in statistics indicating the value below which a given percentage of observations fall.",
  "what is a quantile": "A quantile is a cut point dividing the range of a probability distribution into continuous intervals.",
  "what is a donut chart": "A donut chart is a variant of the pie chart, with a blank center allowing for additional information.",
  "what is a area chart": "An area chart is a line chart with the area between the line and the axis shaded.",
  "what is a stacked bar chart": "A stacked bar chart is a bar chart that uses segmented bars to represent data values.",
  "what is a stacked area chart": "A stacked area chart is an area chart that shows the contribution of each value to the total over time.",
  "what is a waterfall chart": "A waterfall chart is a form of data visualization that helps in understanding the cumulative effect of sequentially introduced positive or negative values.",
  "what is a funnel chart": "A funnel chart is a graphical representation of stages in a process, showing the decreasing quantity at each stage.",
  "what is a sunburst chart": "A sunburst chart is a multilevel pie chart used to visualize hierarchical data.",
  "what is a chord diagram": "A chord diagram is a graphical method of displaying the inter-relationships between data in a matrix.",
  "what is a network graph": "A network graph is a visualization that shows relationships between entities through nodes and links.",
  "what is a force directed graph": "A force-directed graph is a type of network graph that uses a physics-based simulation to position nodes.",
  "what is a geographic map": "A geographic map is a visualization that represents spatial data.",
  "what is a choropleth map": "A choropleth map is a thematic map in which areas are shaded in proportion to a statistical variable.",
  "what is a bubble map": "A bubble map is a type of map that uses circles of different sizes to represent data values.",
  "what is a heat map": "A heat map is a graphical representation of data where values are depicted by color on a map.",
  "what is a cartogram": "A cartogram is a map in which some thematic mapping variable is substituted for land area or distance.",
  "what is a dot distribution map": "A dot distribution map is a type of map that uses a dot symbol to show the presence of a feature or phenomenon.",
  "what is a proportional symbol map": "A proportional symbol map uses symbols of different sizes to represent data associated with different areas or locations.",
  "what is a isarithmic map": "An isarithmic map is a type of thematic map that represents data continuously over space using lines of constant value.",
  "what is a dasymetric map": "A dasymetric map is a type of thematic map that uses areal symbols to visualize geographic patterns.",
  "what is a flow map": "A flow map is a type of thematic map that shows the movement of objects from one location to another.",
  "what is a mental map": "A mental map is a person's point-of-view perception of their area of interaction.",
  "what is information design": "Information design is the practice of presenting information in a way that fosters efficient and effective understanding.",
  "what is visual analytics": "Visual analytics is the science of analytical reasoning facilitated by interactive visual interfaces.",
  "what is exploratory data analysis": "Exploratory data analysis is an approach to analyzing data sets to summarize their main characteristics.",
  "what is confirmatory data analysis": "Confirmatory data analysis is the part of statistical inference where the evidence is evaluated against a hypothesis.",
  "what is descriptive statistics": "Descriptive statistics are used to describe the basic features of the data in a study.",
  "what is inferential statistics": "Inferential statistics are techniques that allow us to use these samples to make generalizations about the populations from which the samples were drawn.",
  "what is probability": "Probability is the branch of mathematics concerning numerical descriptions of how likely an event is to occur.",
  "what is statistics": "Statistics is the discipline that concerns the collection, organization, analysis, interpretation, and presentation of data.",
  "what is semi supervised learning": "Semi-supervised learning is a class of machine learning tasks that make use of unlabeled data for training.",
  "what is self supervised learning": "Self-supervised learning is a method of machine learning where the data itself provides the supervision.",
  "what is multi task learning": "Multi-task learning is a subfield of machine learning in which multiple tasks are learned simultaneously.",
  "what is meta learning": "Meta learning is a subfield of machine learning where automatic learning algorithms are applied to metadata about machine learning experiments.",
  "what is few shot learning": "Few-shot learning is a type of meta learning where a model is trained to learn new concepts from few examples.",
  "what is one shot learning": "One-shot learning is a type of meta learning where a model is trained to learn new concepts from a single example.",
  "what is zero shot learning": "Zero-shot learning is a type of meta learning where a model is trained to recognize things it has never seen during training.",
  "what is continual learning": "Continual learning is the ability of a model to learn continuously from a stream of data.",
  "what is lifelong learning": "Lifelong learning is the ability of a model to learn continuously from a stream of data.",
  "what is catastrophic forgetting": "Catastrophic forgetting is the tendency of an artificial neural network to forget previously learned information.",
  "what is elastic weight consolidation": "Elastic weight consolidation is a method to mitigate catastrophic forgetting.",
  "what is progressive neural networks": "Progressive neural networks are a method for continual learning.",
  "what is knowledge distillation": "Knowledge distillation is the process of transferring knowledge from a large model to a smaller one.",
  "what is model compression": "Model compression is the process of reducing the size of a machine learning model.",
  "what is quantization": "Quantization is the process of reducing the precision of the numbers used in a model.",
  "what is pruning": "Pruning is the process of removing unnecessary parts of a model.",
  "what is low rank approximation": "Low-rank approximation is a method for model compression.",
  "what is knowledge transfer": "Knowledge transfer is the process of transferring knowledge from one model to another.",
  "what is multi modal learning": "Multi-modal learning is a type of machine learning that combines multiple types of data.",
  "what is cross modal learning": "Cross-modal learning is a type of multi-modal learning where information from one modality is used to help another modality.",
  "what is embodied ai": "Embodied AI is the field of building AI systems that interact with the world through a physical body.",
  "what is robot learning": "Robot learning is the study of techniques that enable a robot to acquire new knowledge or skills.",
  "what is imitation learning in robotics": "Imitation learning in robotics is the process of learning a policy from demonstrations.",
  "what is reinforcement learning in robotics": "Reinforcement learning in robotics is the process of learning a policy through trial and error.",
  "what is sim to real transfer": "Sim-to-real transfer is the process of transferring policies learned in simulation to the real world.",
  "what is domain randomization": "Domain randomization is a technique for sim-to-real transfer.",
  "what is domain adaptation": "Domain adaptation is a field of machine learning that deals with scenarios where training and test data come from different distributions.",
  "what is adversarial training": "Adversarial training is a technique for improving the robustness of machine learning models.",
  "what is robust optimization": "Robust optimization is a field of optimization that deals with uncertainty in the data.",
  "what is fairness in machine learning": "Fairness in machine learning is the study of how to ensure that machine learning models do not discriminate.",
  "what is accountability in machine learning": "Accountability in machine learning is the study of how to ensure that machine learning models are responsible.",
  "what is transparency in machine learning": "Transparency in machine learning is the study of how to make machine learning models understandable.",
  "what is interpretability in machine learning": "Interpretability in machine learning is the study of how to make machine learning models understandable.",
  "what is explainability in machine learning": "Explainability in machine learning is the study of how to explain the decisions of machine learning models.",
  "what is counterfactual explanations": "Counterfactual explanations are a method for explaining the decisions of machine learning models.",
  "what is shapley values": "Shapley values are a method for explaining the decisions of machine learning models.",
  "what is lime": "LIME is a method for explaining the decisions of machine learning models.",
  "what is integrated gradients": "Integrated gradients is a method for explaining the decisions of machine learning models.",
  "what is attention maps": "Attention maps are a method for explaining the decisions of machine learning models.",
  "what is model auditing": "Model auditing is the process of evaluating a machine learning model for fairness, accountability, and transparency.",
  "what is bias detection": "Bias detection is the process of identifying bias in machine learning models.",
  "what is bias mitigation": "Bias mitigation is the process of reducing bias in machine learning models.",
  "what is data poisoning": "Data poisoning is a type of attack on machine learning models where the training data is manipulated.",
  "what is model stealing": "Model stealing is a type of attack on machine learning models where an adversary tries to steal the model.",
  "what is membership inference": "Membership inference is a type of attack on machine learning models where an adversary tries to determine if a data point was in the training set.",
  "what is adversarial examples": "Adversarial examples are inputs to machine learning models that an attacker has intentionally designed to cause the model to make a mistake.",
  "what is differential privacy": "Differential privacy is a system for publicly sharing information about a dataset by describing patterns of groups within the dataset.",
  "what is federated learning": "Federated learning is a machine learning technique that trains an algorithm across multiple decentralized devices.",
  "what is secure multi party computation": "Secure multi-party computation is a subfield of cryptography with the goal of creating methods for parties to jointly compute a function.",
  "what is homomorphic encryption": "Homomorphic encryption is a form of encryption that allows computation on ciphertexts.",
  "what is synthetic data": "Synthetic data is data that is artificially generated rather than obtained by direct measurement.",
  "what is data augmentation": "Data augmentation is the process of artificially increasing the size of a training dataset.",
  "what is generative model": "A generative model is a model that can generate new data that is similar to the training data.",
  "what is discriminative model": "A discriminative model is a model that learns the boundary between classes.",
  "what is bayesian network": "A Bayesian network is a probabilistic graphical model that represents a set of variables and their conditional dependencies.",
  "what is markov chain": "A Markov chain is a stochastic model describing a sequence of possible events.",
  "what is hidden markov model": "A hidden Markov model is a statistical Markov model in which the system being modeled is assumed to be a Markov process.",
  "what is conditional random field": "A conditional random field is a statistical modeling method often applied in pattern recognition and machine learning.",
  "what is graphical model": "A graphical model is a probabilistic model for which a graph expresses the conditional dependence structure between random variables.",
  "what is factor graph": "A factor graph is a bipartite graph representing the factorization of a function.",
  "what is sum product algorithm": "The sum-product algorithm is a message-passing algorithm for performing inference on graphical models.",
  "what is belief propagation": "Belief propagation is a message-passing algorithm for performing inference on graphical models.",
  "what is variational inference": "Variational inference is a method for approximating intractable integrals arising in Bayesian inference.",
  "what is markov chain monte carlo": "Markov chain Monte Carlo is a class of algorithms for sampling from a probability distribution.",
  "what is gibbs sampling": "Gibbs sampling is a Markov chain Monte Carlo algorithm for obtaining a sequence of observations.",
  "what is metropolis hastings": "The Metropolis–Hastings algorithm is a Markov chain Monte Carlo method for obtaining a sequence of random samples.",
  "what is hamiltonian monte carlo": "Hamiltonian Monte Carlo is a Markov chain Monte Carlo algorithm for sampling from a probability distribution.",
  "what is no u turn sampler": "The No-U-Turn Sampler is an extension of Hamiltonian Monte Carlo.",
  "what is expectation maximization": "The expectation–maximization algorithm is an iterative method to find maximum likelihood estimates.",
  "what is variational bayes": "Variational Bayes is an approximation to the true posterior in Bayesian inference.",
  "what is bayesian optimization": "Bayesian optimization is a sequential design strategy for global optimization of black-box functions.",
  "what is gaussian process": "A Gaussian process is a stochastic process whose realizations consist of random values associated with every point in a range of times or space.",
  "what is bagging": "Bagging is an ensemble meta-algorithm designed to improve the stability and accuracy of machine learning algorithms.",
  "what is boosting": "Boosting is an ensemble meta-algorithm for primarily reducing bias, and also variance in supervised learning.",
  "what is stacking": "Stacking is an ensemble learning technique that combines multiple classification or regression models.",
  "what is blending": "Blending is an ensemble learning technique that combines multiple classification or regression models.",
  "what is ensemble learning": "Ensemble learning is the process of combining multiple models to solve a machine learning problem.",
  "what is model selection": "Model selection is the process of selecting the best model from a set of candidate models.",
  "what is hyperparameter tuning": "Hyperparameter tuning is the process of selecting the best hyperparameters for a machine learning model.",
  "what is grid search": "Grid search is a method for hyperparameter tuning that exhaustively searches through a manually specified subset of the hyperparameter space.",
  "what is random search": "Random search is a method for hyperparameter tuning that randomly samples from the hyperparameter space.",
  "what is evolutionary algorithms": "Evolutionary algorithms are a family of algorithms for global optimization inspired by biological evolution.",
  "what is genetic algorithms": "Genetic algorithms are a type of evolutionary algorithm.",
  "what is particle swarm optimization": "Particle swarm optimization is a computational method that optimizes a problem by iteratively trying to improve a candidate solution.",
  "what is ant colony optimization": "Ant colony optimization is a probabilistic technique for solving computational problems which can be reduced to finding good paths through graphs.",
  "what is simulated annealing": "Simulated annealing is a probabilistic technique for approximating the global optimum of a given function.",
  "what is tabu search": "Tabu search is a metaheuristic search method that uses local search methods.",
  "what is gradient descent": "Gradient descent is a first-order iterative optimization algorithm for finding a local minimum of a differentiable function.",
  "what is stochastic gradient descent": "Stochastic gradient descent is an iterative method for optimizing an objective function with suitable smoothness properties.",
  "what is mini batch gradient descent": "Mini-batch gradient descent is a variant of gradient descent that splits the training dataset into small batches.",
  "what is momentum": "Momentum is a method that helps accelerate gradient descent in the relevant direction.",
  "what is nesterov momentum": "Nesterov momentum is a variant of momentum that has better theoretical convergence guarantees.",
  "what is adagrad": "Adagrad is an algorithm for gradient-based optimization that adapts the learning rate to the parameters.",
  "what is adadelta": "Adadelta is an extension of Adagrad that seeks to reduce its aggressive, monotonically decreasing learning rate.",
  "what is rmsprop": "RMSprop is an unpublished adaptive learning rate method proposed by Geoff Hinton.",
  "what is adam": "Adam is an optimization algorithm that can be used instead of the classical stochastic gradient descent procedure.",
  "what is adamax": "Adamax is a variant of Adam based on the infinity norm.",
  "what is nadam": "Nadam is an extension of Adam that incorporates Nesterov momentum.",
  "what is amsgrad": "AMSGrad is a variant of Adam that is designed to converge to a better solution.",
  "what is learning rate schedule": "A learning rate schedule is a method for adjusting the learning rate during training.",
  "what is learning rate decay": "Learning rate decay is a method for reducing the learning rate over time.",
  "what is cyclical learning rates": "Cyclical learning rates is a method for setting the learning rate that cycles between a base and a maximum value.",
  "what is one cycle policy": "The one cycle policy is a learning rate schedule that uses one cycle of learning rate values.",
  "what is warm restarts": "Warm restarts is a method for resetting the learning rate to its initial value after a number of iterations.",
  "what is early stopping": "Early stopping is a form of regularization used to avoid overfitting when training a learner with an iterative method.",
  "what is dropout": "Dropout is a regularization technique for reducing overfitting in neural networks.",
  "what is weight decay": "Weight decay is a regularization technique that adds a penalty to the loss function.",
  "what is batch normalization": "Batch normalization is a technique for training very deep neural networks.",
  "what is layer normalization": "Layer normalization is a technique for normalizing the activations of a layer.",
  "what is instance normalization": "Instance normalization is a technique for normalizing the activations of a layer.",
  "what is group normalization": "Group normalization is a technique for normalizing the activations of a layer.",
  "what is spectral normalization": "Spectral normalization is a technique for stabilizing the training of discriminators in Generative Adversarial Networks.",
  "what is weight initialization": "Weight initialization is the process of setting the initial values of the weights of a neural network.",
  "what is xavier initialization": "Xavier initialization is a method for initializing the weights of a neural network.",
  "what is he initialization": "He initialization is a method for initializing the weights of a neural network.",
  "what is orthogonal initialization": "Orthogonal initialization is a method for initializing the weights of a neural network.",
  "what is fine tuning": "Fine-tuning is a process of taking a pre-trained model and training it further on a new task.",
  "what is feature extraction": "Feature extraction is the process of using a pre-trained model as a fixed feature extractor.",
  "what is pre trained model": "A pre-trained model is a model that has been trained on a large dataset and can be used for transfer learning.",
  "what is model zoo": "A model zoo is a collection of pre-trained models.",
  "what is tensorflow hub": "TensorFlow Hub is a library for the publication, discovery, and consumption of reusable parts of machine learning models.",
  "what is pytorch hub": "PyTorch Hub is a pre-trained model repository designed to facilitate research reproducibility.",
  "what is huggingface transformers": "HuggingFace Transformers is a library of pre-trained models for natural language processing.",
  "what is timm": "timm is a library containing state-of-the-art PyTorch image models.",
  "what is detectron2": "Detectron2 is Facebook AI Research's next-generation library that provides state-of-the-art detection and segmentation algorithms.",
  "what is mmdetection": "MMDetection is an open source object detection toolbox based on PyTorch.",
  "what is mmsegmentation": "MMSegmentation is an open source semantic segmentation toolbox based on PyTorch.",
  "what is mmocr": "MMOCR is an open source toolbox for text detection, recognition, and understanding.",
  "what is fairseq": "Fairseq is a sequence modeling toolkit that allows researchers and developers to train custom models.",
  "what is openai gym": "OpenAI Gym is a toolkit for developing and comparing reinforcement learning algorithms.",
  "what is stable baselines": "Stable Baselines is a set of high-quality implementations of reinforcement learning algorithms.",
  "what is ray rllib": "Ray RLlib is an open-source library for reinforcement learning that offers both high scalability and a unified API.",
  "what is dopamine": "Dopamine is a research framework for fast prototyping of reinforcement learning algorithms.",
  "what is tensorforce": "TensorForce is an open-source deep reinforcement learning framework.",
  "what is coach": "Coach is a python reinforcement learning framework.",
  "what is garage": "Garage is a toolkit for developing and evaluating reinforcement learning algorithms.",
  "what is mushroomrl": "MushroomRL is a Python reinforcement learning library.",
  "what is chirpy": "Chirpy is a Python library for reinforcement learning.",
  "what is keras rl": "Keras-RL is a deep reinforcement learning library for Keras.",
  "what is pytorch lightning": "PyTorch Lightning is a lightweight PyTorch wrapper for high-performance AI research.",
  "what is ignite": "Ignite is a high-level library to help with training and evaluating neural networks in PyTorch.",
  "what is fastai": "Fastai is a deep learning library that provides practitioners with high-level components.",
  "what is skorch": "Skorch is a scikit-learn compatible neural network library that wraps PyTorch.",
  "what is catalyst": "Catalyst is a PyTorch framework for deep learning research and development.",
  "what is datasets": "Datasets is a library for easily accessing and sharing datasets for audio, computer vision, and natural language processing.",
  "what is tokenizers": "Tokenizers is a library for fast state-of-the-art tokenization.",
  "what is accelerate": "Accelerate is a library that enables the same PyTorch code to be run across any distributed configuration.",
  "what is deepspeed": "DeepSpeed is a deep learning optimization library that makes distributed training easy, efficient, and effective.",
  "what is horovod": "Horovod is a distributed training framework for TensorFlow, Keras, PyTorch, and Apache MXNet.",
  "what is ray": "Ray is a fast and simple framework for building and running distributed applications.",
  "what is dask": "Dask is a flexible library for parallel computing in Python.",
  "what is modin": "Modin is a library that speeds up your Pandas workflows by changing a single line of code.",
  "what is vaex": "Vaex is a high performance Python library for lazy Out-of-Core DataFrames.",
  "what is cudf": "cuDF is a GPU DataFrame library for loading, joining, aggregating, filtering, and otherwise manipulating data.",
  "what is rapids": "RAPIDS is a suite of open-source software libraries and APIs for executing data science pipelines entirely on GPUs.",
  "what is numba": "Numba is an open source JIT compiler that translates a subset of Python and NumPy code into fast machine code.",
  "what is cython": "Cython is an optimising static compiler for both the Python programming language and the extended Cython programming language.",
  "what is pypy": "PyPy is an alternative implementation of the Python programming language.",
  "what is jax": "JAX is a library for high-performance numerical computing and machine learning research.",
  "what is flax": "Flax is a neural network library for JAX that is designed for flexibility.",
  "what is trax": "Trax is a deep learning library focused on clarity and speed.",
  "what is haiku": "Haiku is a library for building neural networks in JAX.",
  "what is objax": "Objax is an object-oriented and functional API for building neural networks in JAX.",
  "what is equinox": "Equinox is a library for building neural networks in JAX.",
  "what is optax": "Optax is a gradient processing and optimization library for JAX.",
  "what is chex": "Chex is a library of utilities for helping to write reliable JAX code.",
  "what is dm haiku": "DM Haiku is a library for building neural networks in JAX.",
  "what is keras": "Keras is an open-source software library that provides a Python interface for artificial neural networks.",
  "what is mxnet": "Apache MXNet is an open-source deep learning software framework.",
  "what is cntk": "Microsoft Cognitive Toolkit is a deep learning framework.",
  "what is theano": "Theano is a Python library and optimizing compiler for manipulating and evaluating mathematical expressions.",
  "what is caffe": "Caffe is a deep learning framework made with expression, speed, and modularity in mind.",
  "what is caffe2": "Caffe2 is a lightweight, modular, and scalable deep learning framework.",
  "what is chainer": "Chainer is a Python-based deep learning framework.",
  "what is dynet": "DyNet is a neural network library developed in C++ with bindings in Python.",
  "what is julia": "Julia is a high-level, high-performance, dynamic programming language.",
  "what is flux": "Flux is a machine learning library for Julia.",
  "what is tensorflow js": "TensorFlow.js is a library for machine learning in JavaScript.",
  "what is ml5 js": "ml5.js is a friendly machine learning library for the web.",
  "what is brain js": "Brain.js is a library for neural networks in JavaScript.",
  "what is synaptic": "Synaptic is a javascript neural network library for node.js and the browser.",
  "what is convnetjs": "ConvNetJS is a Javascript library for training Deep Learning models.",
  "what is deeplearn js": "DeepLearn.js is a hardware-accelerated machine intelligence library for the web.",
  "what is onnx": "ONNX is an open format built to represent machine learning models.",
  "what is coreml": "Core ML is a machine learning framework used by Apple products.",
  "what is mlkit": "ML Kit is a mobile SDK that brings Google's machine learning expertise to Android and iOS apps.",
  "what is tensorflow lite": "TensorFlow Lite is a set of tools to help developers run TensorFlow models on mobile, embedded, and IoT devices.",
  "what is pytorch mobile": "PyTorch Mobile is a framework for deploying PyTorch models on mobile devices.",
  "what is openvino": "OpenVINO is a toolkit for developing applications and solutions that emulate human vision.",
  "what is tensorrt": "TensorRT is a SDK for high-performance deep learning inference.",
  "what is onnx runtime": "ONNX Runtime is a cross-platform inference and training machine-learning accelerator.",
  "what is mlflow": "MLflow is an open source platform for the machine learning lifecycle.",
  "what is kubeflow": "Kubeflow is a machine learning toolkit for Kubernetes.",
  "what is polyaxon": "Polyaxon is a platform for building, training, and monitoring large scale deep learning applications.",
  "what is neptune": "Neptune is a metadata store for MLOps, built for research and production teams.",
  "what is weights and biases": "Weights & Biases is a platform for tracking machine learning experiments.",
  "what is comet ml": "Comet.ml is a platform for tracking, comparing, explaining, and optimizing machine learning experiments.",
  "what is sacred": "Sacred is a tool to help you configure, organize, log and reproduce experiments.",
  "what is guild ai": "Guild AI is a tool to track and compare machine learning experiments.",
  "what is dvc": "DVC is a version control system for machine learning projects.",
  "what is git lfs": "Git LFS is a Git extension for versioning large files.",
  "what is pachyderm": "Pachyderm is a data versioning and pipelining platform that uses containers for computation.",
  "what is lakefs": "LakeFS is an open source tool that transforms your object storage into a Git-like repository.",
  "what is delta lake": "Delta Lake is an open-source storage layer that brings ACID transactions to Apache Spark and big data workloads.",
  "what is iceberg": "Apache Iceberg is an open table format for huge analytic datasets.",
  "what is hive": "Apache Hive is a data warehouse software project built on top of Apache Hadoop.",
  "what is presto": "Presto is an open source distributed SQL query engine for running interactive analytic queries.",
  "what is spark": "Apache Spark is a unified analytics engine for large-scale data processing.",
  "what is hadoop": "Apache Hadoop is a collection of open-source software utilities that facilitates using a network of computers.",
  "what is hdfs": "HDFS is a distributed file system that provides high-throughput access to application data.",
  "what is mapreduce": "MapReduce is a programming model and an associated implementation for processing and generating big data sets.",
  "what is pig": "Apache Pig is a platform for analyzing large data sets that consists of a high-level language for expressing data analysis programs.",
  "what is hbase": "Apache HBase is an open-source, distributed, versioned, non-relational database.",
  "what is filebeat": "Filebeat is a lightweight shipper for forwarding and centralizing log data.",
  "what is metricbeat": "Metricbeat is a lightweight shipper that you can install on your servers to periodically collect metrics.",
  "what is packetbeat": "Packetbeat is a lightweight network packet analyzer.",
  "what is heartbeat": "Heartbeat is a lightweight daemon that periodically checks the status of your services.",
  "what is auditbeat": "Auditbeat is a lightweight shipper that audits the activities of users and processes on your systems.",
  "what is functionbeat": "Functionbeat is a lightweight shipper that collects and ships data from cloud platforms.",
  "what is journalbeat": "Journalbeat is a lightweight shipper for forwarding and centralizing systemd journal logs.",
  "what is winlogbeat": "Winlogbeat is a lightweight shipper for forwarding Windows event logs.",
  "what is aws cloudwatch": "AWS CloudWatch is a monitoring and observability service.",
  "what is aws cloudtrail": "AWS CloudTrail is a service that enables governance, compliance, and operational auditing.",
  "what is aws config": "AWS Config is a service that enables you to assess, audit, and evaluate the configurations of your AWS resources.",
  "what is aws x ray": "AWS X-Ray helps developers analyze and debug production, distributed applications.",
  "what is azure monitor": "Azure Monitor is a comprehensive solution for collecting, analyzing, and acting on telemetry from your cloud and on-premises environments.",
  "what is google cloud monitoring": "Google Cloud Monitoring provides visibility into the performance, uptime, and overall health of cloud-powered applications.",
  "what is google cloud logging": "Google Cloud Logging is a fully managed service that performs at scale and can ingest application and system log data.",
  "what is google cloud trace": "Google Cloud Trace is a distributed tracing system that collects latency data from your applications.",
  "what is google cloud debugger": "Google Cloud Debugger is a feature of Google Cloud that lets you inspect the state of an application at any code location.",
  "what is google cloud profiler": "Google Cloud Profiler is a statistical, low-overhead profiler that continuously gathers CPU usage and memory-allocation information.",
  "what is dynatrace": "Dynatrace is a software intelligence platform that provides advanced observability.",
  "what is appdynamics": "AppDynamics is an application performance management and IT operations analytics company.",
  "what is sumo logic": "Sumo Logic is a cloud-based machine data analytics platform.",
  "what is logz io": "Logz.io is a cloud observability platform providing log, metric, and trace analytics.",
  "what is elastic stack": "The Elastic Stack is a collection of open-source products from Elastic: Elasticsearch, Kibana, Logstash, and Beats.",
  "what is telegraf": "Telegraf is a plugin-driven server agent for collecting and reporting metrics.",
  "what is fluentd": "Fluentd is an open source data collector for unified logging layer.",
  "list files in directory": "Running command: ls -la  # or dir on Windows",
  "print working directory": "Running command: pwd",
  "show current directory": "Your current directory is {current_directory}.",
  "make a new file": "Running command: touch {filename}  # or type nul > {filename} on Windows",
  "copy a file": "Running command: cp {source} {destination}  # or copy on Windows",
  "move a file": "Running command: mv {source} {destination}  # or move on Windows",
  "show disk usage": "Running command: df -h  # or wmic logic on Windows",
  "show top processes": "Running command: top  # or tasklist on Windows",
  "kill process [process_name]": "Terminating process: {process_name}. Running command: pkill {process_name}  # or taskkill on Windows",
  "search for a process": "Searching for process. Running command: ps aux | grep {process_name}  # or tasklist | findstr on Windows",
  "initialize a git repository": "Initializing a new Git repository here. Running command: git init.",
  "git status": "Showing the status of the Git repository. Running command: git status.",
  "git add all": "Staging all changes. Running command: git add .",
  "git commit": "Committing changes. Please provide a commit message.",
  "git push": "Pushing commits to the remote repository. Running command: git push.",
  "git pull": "Pulling latest changes from the remote repository. Running command: git pull.",
  "create a new branch": "Creating a new branch. What should we name it?",
  "run tests": "Running the test suite for this project.",
  "run linter": "Running the linter on the codebase.",
  "build project": "Starting the project build process.",
  "start development server": "Launching the local development server.",
  "install dependencies": "Installing project dependencies. Running command: npm install  # or pip install -r requirements.txt, etc.",
  "open github": "Opening GitHub in your browser.",
  "open gitlab": "Opening GitLab in your browser.",
  "open stack overflow": "Opening Stack Overflow.",
  "search google for [query]": "Searching Google for: {query}",
  "search stack overflow for [query]": "Searching Stack Overflow for: {query}",
  "what is the weather": "Checking the weather for your location.",
  "define [word]": "Looking up the definition of {word}.",
  "set a timer for [x] minutes": "Setting a timer for {x} minutes.",
  "start pomodoro timer": "Starting a 25-minute Pomodoro timer.",
  "show my schedule": "Checking your calendar for today.",
  "aws list s3 buckets": "Running command: aws s3 ls",
  "aws list ec2 instances": "Running command: aws ec2 describe-instances",
  "gcloud list projects": "Running command: gcloud projects list",
  "gcloud list instances": "Running command: gcloud compute instances list",
  "azure list vms": "Running command: az vm list",
  "docker ps": "Showing running containers. Running command: docker ps",
  "docker logs [container]": "Fetching logs for container: {container}. Running command: docker logs {container}",
  "kubectl get pods": "Running command: kubectl get pods",
  "kubectl get nodes": "Running command: kubectl get nodes",
  "terraform init": "Initializing Terraform. Running command: terraform init",
  "terraform apply": "Applying Terraform plan. Running command: terraform apply",
  "clear terminal": "Clearing the terminal screen. Running command: clear  # or cls on Windows",
  "show command history": "Showing your command line history.",
  "git log": "Showing the commit history. Running command: git log --oneline",
  "git checkout [branch]": "Switching to branch: {branch}. Running command: git checkout {branch}",
  "git merge [branch]": "Merging branch: {branch} into the current branch. Running command: git merge {branch}",
  "git stash": "Stashing your uncommitted changes. Running command: git stash",
  "git diff": "Showing changes between commits, commit and working tree, etc.",
  "show my public ip": "Your public IP address is {public_ip}.",
  "show my local ip": "Your local IP address is {local_ip}.",
  "flush dns": "Flushing the DNS resolver cache.",
  "restart network": "Restarting the network service.",
  "check port [port_number]": "Checking if port {port_number} is in use.",
  "ping [hostname]": "Pinging {hostname} to check connectivity.",
  "traceroute [hostname]": "Running traceroute to {hostname}.",
  "check internet speed": "Testing your internet download and upload speed.",
  "system information": "Displaying detailed system information (OS, CPU, Memory).",
  "check cpu usage": "Showing current CPU usage.",
  "check memory usage": "Showing current memory (RAM) usage.",
  "check gpu usage": "Showing current GPU usage (if supported).",
  "list services": "Listing all running services.",
  "start service [service_name]": "Starting the service: {service_name}.",
  "stop service [service_name]": "Stopping the service: {service_name}.",
  "enable service [service_name]": "Enabling the service: {service_name} to start on boot.",
  "disable service [service_name]": "Disabling the service: {service_name} from starting on boot.",
  "list environment variables": "Listing all environment variables.",
  "set environment variable [name][value]": "Setting environment variable {name} to {value}.",
  "unset environment variable [name]": "Removing the environment variable {name}.",
  "check python version": "Showing the installed Python version.",
  "check node version": "Showing the installed Node.js version.",
  "check java version": "Showing the installed Java version.",
  "check go version": "Showing the installed Go version.",
  "check rust version": "Showing the installed Rust version.",
  "open localhost": "Opening http://localhost in your browser.",
  "open localhost port [port]": "Opening http://localhost:{port} in your browser.",
  "open postgres": "Opening a connection to the local PostgreSQL database.",
  "open mysql": "Opening a connection to the local MySQL database.",
  "open redis cli": "Opening the Redis command-line interface.",
  "run migrations": "Running database migrations for the current project.",
  "rollback migrations": "Rolling back the last database migration.",
  "seed database": "Seeding the database with sample data.",
  "open api documentation": "Opening the API documentation (e.g., Swagger, Redoc) for the current project.",
  "run formatter": "Running the code formatter (e.g., Prettier, Black) on the codebase.",
  "run type checker": "Running the static type checker (e.g., mypy, TypeScript compiler).",
  "show todos in code": "Searching for TODO, FIXME, etc. comments in the codebase.",
  "show recent files": "Showing the most recently edited files in the project.",
  "what is my current task": "Checking the current task from your project management tool (e.g., Jira, Asana).",
  "log work [time] [task]": "Logging {time} to task {task} in your work management tool.",
  "what are my meetings today": "Checking your calendar for meetings scheduled today.",
  "join my next meeting": "Connecting you to your next scheduled meeting (Zoom, Teams, etc.).",
  "take a break": "Suggesting a 5-minute break. Setting a timer.",
  "suggest a shortcut": "Suggesting a keyboard shortcut for the last action you performed.",
  "what is the time": "The current time is {current_time}.",
  "what is the date": "Today's date is {current_date}.",
  "generate ssh key": "Generating a new SSH key pair.",
  "encrypt file [filename]": "Encrypting the file: {filename}.",
  "decrypt file [filename]": "Decrypting the file: {filename}.",
  "compress folder [folder_name]": "Compressing the folder: {folder_name} into a zip archive.",
  "decompress archive [archive_name]": "Extracting the archive: {archive_name}.",
  "what is my network speed": "Running a quick network speed test.",
  "monitor network traffic": "Starting a tool to monitor real-time network traffic.",
  "find large files": "Finding files larger than 100MB in the current directory.",
  "clean temp files": "Cleaning temporary files to free up disk space.",
  "update system": "Checking for and installing system updates.",
  "list installed packages": "Listing all packages installed via package manager (e.g., brew, apt, pip).",
  "brew update": "Updating Homebrew and the list of available packages.",
  "upgrade packages": "Upgrading installed packages to their latest versions.",
  "show hardware info": "Displaying detailed hardware information (e.g., with lshw on Linux).",
  "eject external drive": "Ejecting the external drive safely.",
  "connect to vpn [vpn_name]": "Connecting to the VPN profile: {vpn_name}.",
  "disconnect vpn": "Disconnecting from the currently active VPN.",
  "open aws console": "Opening the AWS Management Console in your browser.",
  "open azure portal": "Opening the Microsoft Azure Portal in your browser.",
  "open gcp console": "Opening the Google Cloud Console in your browser.",
  "show aws credentials": "Showing the currently configured AWS credentials and region.",
  "open kubernetes dashboard": "Opening the Kubernetes dashboard for the current context.",
  "forward port [port]": "Forwarding local port {port} to a pod in the cluster.",
  "describe pod [pod_name]": "Showing detailed information about the pod: {pod_name}.",
  "get pod logs [pod_name]": "Fetching the logs from pod: {pod_name}.",
  "ssh into instance [instance_id]": "Opening an SSH connection to EC2 instance: {instance_id}.",
  "open s3 bucket [bucket_name]": "Opening the S3 bucket: {bucket_name} in the browser.",
  "create an issue": "Creating a new issue on GitHub/GitLab for the current project.",
  "what is the stock price of [ticker]": "Checking the current stock price for {ticker}.",
  "how is my portfolio doing": "Checking the performance of your stock portfolio.",
  "translate [text] to [language]": "Translating \"{text}\" to {language}.",
  "read this out loud": "Reading the last response or selected text aloud.",
  "speak slower": "Reducing the speech rate of the assistant.",
  "speak faster": "Increasing the speech rate of the assistant.",
  "stop speaking": "Stopping the current speech output.",
  "mute yourself": "Muting the assistant's audio output.",
  "unmute yourself": "Unmuting the assistant's audio output.",
  "change your voice": "Changing the TTS voice to a different variant.",
  "good morning": "Good morning! Here's the weather and your calendar for the day.",
  "good night": "Good night! Shutting down non-essential processes. Sleep well.",
  "thank you": "You're welcome!",
  "flower": "Flowers, also known as blossoms and blooms, are the reproductive structures of flowering plants.",
  "electron": "The electron (e-, or β− in nuclear reactions) is a subatomic particle whose electric charge is negative one elementary charge."
}